

data = """
<noinclude>{{面包屑|导航|武器}}</noinclude>
{{导航盒
|名称= 模板:武器导航
|标题= 战斗
|折叠 = uncollapsed

|分组1 = 武器
|列表1 =
* {{I|手枪}}
* {{I|冲锋枪}}
* {{I|霰弹枪}}
* {{I|冲锋霰弹枪}}
* {{I|火箭筒}}
* {{I|火焰喷射器}}
* {{I|地雷}}

|分组2 = 弹药
|列表2 =
* {{I|标准弹匣}}
* {{I|穿甲弹匣}}
* {{I|贫铀弹匣}}
* {{I|标准霰弹}}
* {{I|穿甲霰弹}}
* {{I|标准炮弹}}
* {{I|爆破炮弹}}
* {{I|贫铀炮弹}}
* {{I|爆破贫铀炮弹}}
* {{I|重炮炮弹}}
* {{I|标准火箭弹}}
* {{I|爆破火箭弹}}
* {{I|原子火箭弹}}
* {{I|油料储罐}}

|分组3 = 胶囊
|列表3 =
* {{I|标准手雷}}
* {{I|集束手雷}}
* {{I|剧毒胶囊}}
* {{I|减速胶囊}}
* {{I|防御无人机胶囊}}
* {{I|掩护无人机胶囊}}
* {{I|进攻无人机胶囊}}
* {{I|放电防御瞄准器}}
* {{I|重炮袭击瞄准器}}

|分组4 = 装备
|列表4 =
* {{I|轻型护甲}}
* {{I|重型护甲}}
* {{I|模块装甲}}
* {{I|能量装甲}}
* {{I|能量装甲MK2}}

|分组5 = 装备模块
|列表5 =
* {{I|太阳能模块}}
* {{I|聚变堆模块}}
* {{I|能量盾模块}}
* {{I|能量盾模块MK2}}
* {{I|电池组模块}}
* {{I|电池组模块MK2}}
* {{I|激光防御模块}}
* {{I|放电防御模块}}
* {{I|锚定模块}}
* {{I|外骨骼模块}}
* {{I|机器人指令模块}}
* {{I|机器人指令模块MK2}}
* {{I|夜视模块}}

|分组6 = 防御
|列表6 =
* {{I|墙壁}}
* {{I|闸门}}
* {{I|机枪炮塔}}
* {{I|激光炮塔}}
* {{I|火焰炮塔}}
* {{I|重炮炮塔}}
* {{I|雷达}}
* {{I|火箭发射井}}

|分组7 = [[模板:物品配方|导航]]
|列表7 =
* [[模板:物流导航|物流]]
* [[模板:生产导航|生产]]
* [[模板:零件导航|零件]]
* [[模板:武器导航|武器]]
* [[模板:科技导航|科技]]
}}<noinclude>{{文献资料}}</noinclude>

"""

lines = data.split("\n")

for line in lines:
    if line.startswith("* {{I|"):
        name = line.replace("* {{I|", "").replace("}}", "")
        if name.endswith(" 1") or name.endswith(" 2") or name.endswith(" 3"):
            name = name.replace(" ", "")
    # *{{图标|科技-高等电学||科技:高等电学|16|frame=none}}[[科技:高等电学|高等电学]]
        new_line = "*{{图标|" + name + "||物品:" + name + "|16|frame=none}}[[物品:" + name + "|" + name + "]]"
        data = data.replace(line, new_line)

print(data)

# 更新导航，链接到新的物品页面。 新的导航页面基本没有使用高开销解析函数。